"""
Ниже на четырёх языках программирования записана программа, которая вводит натуральное число 𝑥,
выполняет преобразования, а затем выводит одно число. Укажите наименьшее возможное значение 𝑥,
при вводе которого программа выведет число 140.
"""

x = int(input())
a = 1

while x > 0:
    a *= x % 11
    x = x // 11
print(a)

# for x in range(0, 200):
#     a = 1
#     print(1)
#     while x < 201:
#         print(2)
#         a *= x % 11
#         x = x // 11
#     if a == 140:
#         print(x)
# n = 1
# x = 1
# a = 1
# while n != 0:
#     if a == 140:
#         print('Ответ:', x)
#     while x > 0:
#         a *= x % 11
#         x = x // 11
#     x += 1


# result = 140
# a = 1
# x = 1
# while a != result:
#     while x < 100:
#         a *= x % 11
#         if a == 140:
#             print(x)
#         x = x // 11
#     x += 1
# print(x)

# x = 1
# while x != 0:
#     a = 1
#     while x < 50:
#         a *= x % 11
#         if a == 140:
#             print(x)
#         x = x // 11
#     if a == 140:
#         print('Ответ:', x)
#     x += 1
