"""
Все 5-буквенные слова, составленные из букв А, О, У, записаны в алфавитном порядке.
Вот начало списка:
1. УУУУУ
2. УУУУО
3. УУУУА
4. УУУОУ
……
Запишите слово, которое стоит на 240-м месте от начала списка.
"""
n = 240 - 1
three = ''
while n > 0:
    three = str(n % 3) + three
    n //= 3
print(three)
