"""
Задание 14 (№626).
Сколько единиц в двоичной записи числа 8^1023 + 2^1024 – 3?
"""
x = 8 ** 1023 + 2 ** 1024 - 3
# while x > 0:
#     x //= 0
b = bin(x)[2:]
print(b.count('1'))
