"""
№ 595
(К. Амеличев) Алгоритм вычисления функции F(n) задан следующими соотношениями:
F(n) = n при n ≤ 3;
F(n) = n // 4 + F(n–3) при 3 < n ≤ 32;
F(n) = 2 · F(n–5) при n > 32
Здесь // обозначает деление нацело.
В качестве ответа на задание выведите значение F(100).

655360
"""
n = 100
k = n + 1
F = [1] * k
for i in range(k):
    if i <= 3:
        F[i] = i
    if 3 < i <= 32:
        F[i] = i // 4 + F[i - 3]
    if i > 32:
        F[i] = 2 * F[i - 5]
print(F[n])
