"""
Задание 25 (№1378).
Пусть M – сумма делителей, максимально приближенных к квадратному корню числа,
которые в произведении дают исследуемое число (сомножители). Квадратный корень в качестве делителя не рассматривать.
Если нет делителей, отличных от квадратного корня, единицы и самого числа, значение M считается равным 0.
Напишите программу, которая перебирает целые числа, большие 710 017, в порядке возрастания и ищет среди них такие,
для которых значение M кратно 10 и больше M для предыдущего найденного числа.
Вывести первые 5 найденных чисел и соответствующие им значения M.
Формат вывода: для каждого из 5 таких найденных чисел в отдельной строке сначала выводится само число,
затем – значение М.
Например, для числа 50 M = 5 + 10 = 15
"""

